<?php

/* @var $this yii\web\View */

$this->title = 'Рабочий стол | '.Yii::$app->name;
?>
<div class="dashboard">
    <div class="hpanel">
        <div class="panel-body">
            <div class="table-responsive">
                <table cellpadding="1" cellspacing="1" class="table">
                    <thead>
                    <tr>
                        <th>Наименование</th>
                    </tr>
                    </thead>
                    <tbody>
                    <tr>
                        <td>* везде сделать инструкции</td>
                    </tr>
                    <tr>
                        <td>+ документ по оплате</td>
                    </tr>
                    <tr>
                        <td>+ признак общего доступа для файлов ко всем объектам (shared)</td>
                    </tr>
                    <tr>
                        <td>+ отбор объектов в списке</td>
                    </tr>
                    <tr>
                        <td>* применить sweet alerts к проекту (как bootbox)</td>
                    </tr>
                    <tr>
                        <td>+ переработать профиль, дать возможность загружать и изменять аватар</td>
                    </tr>
                    <tr>
                        <td>+ проработать удаление элементов: номенклатуры, объектов, контрагентов, регионов и т.д.</td>
                    </tr>
                    <tr>
                        <td>+ полный цикл при удалении объекта строительства (удаление документов, табличных частей, файлов)</td>
                    </tr>
                    <tr>
                        <td>+ сделать нормальный NavBar в меню слева, написать свой компонент</td>
                    </tr>
                    <tr>
                        <td>+ сделать чтобы сайдбар открывался (разворачивался) до текущего элемента, в homer это работает</td>
                    </tr>
                    <tr>
                        <td>+ просмотр документа заказчиком (реализовано без авторизации)</td>
                    </tr>
                    <tr>
                        <td>+ не забывать обновлять updated_at при изменении данных, связанных с объектом строительства</td>
                    </tr>
                    <tr>
                        <td>+ в списке документов в карточке объекта выводить еще одну колонку - количество строк табличной части</td>
                    </tr>
                    <tr>
                        <td>+ подстановка единицы измерения и цены после выбора номенклатуры в карточке объекта</td>
                    </tr>
                    <tr>
                        <td>+ загрузка файлов к объектам</td>
                    </tr>
                    <tr>
                        <td></td>
                    </tr>
                    </tbody>
                </table>
            </div>
        </div>
    </div>
</div>
